OpenDTEF-v1812/tutorials/multiphase/interFoam/laminar/vofToLagrangian/eulerianInjection/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication  -s createBlockage topoSet -dict system/topoSetDict.createBlockage
runApplication subsetMesh -overwrite blockage -patch bottom
runApplication -s createPatch topoSet -dict system/topoSetDict.createPatch
runApplication -s createCollector topoSet -dict system/topoSetDict.createCollector

restore0Dir

runApplication decomposePar

runParallel setFields
runParallel $(getApplication)

#------------------------------------------------------------------------------
